Revit 2027 API
StructuralElementDefinitionData.ZOffset Property
 Z offset.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ZOffset { get; }
Public ReadOnly Property ZOffset As Double
	Get
public:
property double ZOffset {
	double get ();
}
member ZOffset : float with get
Property Value
Double
See Also
Reference
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace